INSERT INTO academy (academyName) VALUES ('관리자 확인 필요');
INSERT INTO lecture(lectureName, academyNo) VALUES('관리자 확인 필요', 1);

INSERT INTO academy
VALUES
('2','더조은컴퓨터아카데미 강남점'),
('3','더조은컴퓨터아카데미 종로점'),
('4','더조은컴퓨터아카데미 종각점'),
('5','더조은컴퓨터아카데미 신촌점');

INSERT INTO lecture (lectureName, academyNo)
VALUES
('웹퍼블리싱(Html5,CSS3)','2'),('웹퍼블리싱(Javascript,jQuery','2'),
('반응형웹디자인 포트폴리오','2'),('웹퍼블리셔 초급 - html5 CSS','2'),
('웹퍼블리셔 중급 - JQuery&Javascript','2'),('스마트웹디자인(UI/UX)콘텐츠개발(웹퍼블리셔)A,B_스마트','2'),
('웹디자인(웹퍼블리셔)UI/UX 프론트엔드 양성과정','2'),('시각디자인 GTQ자격취득(일러스트&포토샵)','2'),
('웹퍼블리셔 종합반(반응형 웹디자인)','2'),('편집디자인(전자출판&e-book)디자이너양성_혼합훈련','2'),
('출판편집디자인(전자출판&E-BOOK)','2'),('자바기반 안드로이드 앱 개발','2'),
('빅데이터 시각화(UI) 분석 전문가 양성과정(자바,파이썬, R)A','2'),('안드로이드&IOS 앱 개발자 양성','2'),
('파이썬(Python)프로그래밍','2'),('자바(JAVA)프로그래밍(JSP)','2'),
('파이썬을 활용한 빅데이터 분석실무','2'),('R프로그래밍 활용 빅데이터분석','2'),
('자바(JAVA)기반 하이브리드 앱개발','2'),('SWIFT프로그래밍(IOS)','2'),
('게임프로그래밍개발자 양성(유니티3D)','2'),('게임그래픽(2D,3D&마야)디자이너 양성','2'),
('유니티(Unity)를 활용한 2D3D 게임개발','2'),('유니티(Unity)를 활용한 VR콘텐츠 제작','2'),
('유니티(Unity)를 활용한 영상애니메이션 제작','2'),('3D프린터활용 제품설계제작(제품디자인산업기사 과정평가형)','2'),
('3D프린터 활용 제품디자인 설계제작 (캐드,맥스,라이노)','2'),('제품설계모델링&모형제작(3D프린터)','2'),
('실내환경디자인(캐드,맥스) 실무자 양성_A,B','2'),('전산응용건축제도기능사(AutoCAD)자격증 취득과정','2');

INSERT INTO lecture (lectureName, academyNo)
VALUES
('웹퍼블리셔(웹디자인)UI/UX 프론트엔드 양성과정','3'),('스마트웹디자인(UI/UX)콘텐츠개발','3'),
('UIUX 웹디자인 실무자 양성(웹퍼블리셔,프론트엔드)_혼합훈련','3'),('인터렉티브 웹디자인','3'),
('모바일UI/UX 종합반','3'),('프론트앤드개발자과정','3'),
('편집디자인(전자출판&출판편집)','3'),('출판편집디자인(전자출판&e-book)','3'),
('편집디자인(전자출판&e-book)디자이너_혼합훈련','3'),('시각디자인 GTQ자격취득(일러스트&포토샵)','3'),
('파이썬과 R을 활용한 빅데이터분석(머신러닝,딥러닝)전문가 양성과정','3'),('하이브리드 앱개발(IOS&안드로이드) 및 웹개발자 양성과정','3'),
('정보보안(네트워크,서버)엔지니어 양성과정','3'),('빅데이터분석을 위한 AI(머신러닝,딥러닝) 응용소프트웨어 개발자','3'),
('파이썬과 R을 활용한 빅데이터 분석 실무자 양성_혼합훈련','3'),('파이썬을 활용한 빅데이터분석 전문가','3'),
('유니티를활용한게임프로그래밍개발자(unity)','3'),('게임콘텐츠제작(2D&3D그래픽)실무자 양성과정','3'),
('게임프로그래밍 개발자 양성과정','3'),('영상편집&모션그래픽제작(프리미어,에펙)','3'),
('영상편집(프리미어,에펙)&3D모션그래픽제작','3'),('영상편집제작(프리미어,에펙,모션그래픽)','3'),
('영상제작&모션그래픽(프리미어,에프터이펙트)','3'),('3D프린터를 활용한 제품디자인(CAD,MAX,라이노,3D프린터)','3'),
('제품설계모델링&모형제작(3D프린터)','3'),('3D프린터를 활용한 제품디자인응용모델링(캐드,맥스,라이노)','3');
INSERT INTO lecture (lectureName, academyNo)
VALUES
('웹퍼블리셔(웹디자인)UI/UX 프론트엔드 양성과정','4'),('스마트웹&모바일콘텐츠 개발자(프론트엔드)','4'),
('디지털앱&웹디자인(스마트기기UI&UX디자인)','4'),('스마트웹&모바일콘텐츠개발 양성과정','4'),
('스마트웹디자인(UI/UX)콘텐츠개발','4'),('출판편집디자인(전자출판&e-book)','4'),
('웹디자인(웹퍼블리셔)UI/UX 프론트엔드 양성과정','4'),('UIUX 웹디자인 실무자 양성(웹퍼블리셔,프론트엔드)_혼합훈련','4'),
('(NCS)디지털퍼블리싱 양성과정(편집디자인&E-BOOK)','4'),('편집디자인(전자출판&e-book)디자이너_혼합훈련','4'),
('UIUX기반 스마트 웹&앱 콘텐츠개발자(웹퍼블리셔)_혼합훈련','4'),('출판편집디자인(전자출판&e-book)','4'),
('시각디자인 GTQ자격취득(일러스트&포토샵)','4'),('하이브리드웹&앱(안드로이드,IOS)개발자','4'),
('파이썬과 R을 활용한 빅데이터분석(머신러닝,딥러닝)전문가 양성과정','4'),('머신러닝 플랫폼을 활용한 AI응용소프트웨어 빅데이터분석 개발자','4'),
('하이브리드 앱개발(IOS&안드로이드) 및 웹개발자 양성과정','4'),('정보보안(네트워크,서버)엔지니어 양성과정','4'),
('빅데이터분석을 위한 AI(머신러닝,딥러닝) 응용소프트웨어 개발자','4'),('파이썬빅데이터개발,분석전문가(머신러닝,딥러닝)','4'),
('빅데이터 시각화(UI) 분석 전문가(파이썬, R)_혼합훈련','4'),('파이썬과 R을 활용한 빅데이터 분석 실무자 양성_혼합훈련','4'),
('게임그래픽(2D,3D&마야,VFX)디자이너양성','4'),('유니티를활용한게임프로그래밍개발자(unity)','4'),
('게임콘텐츠제작(2D&3D그래픽)실무자 양성과정','4'),('게임프로그래밍 개발자 양성과정','4'),
('영상편집(프리미어,에펙)&3D모션그래픽제작','4'),('3D프린터를 활용한 제품디자인(CAD,MAX,라이노,3D프린터)','4'),
('제품설계모델링&모형제작(3D프린터)','4'),('기계설계제작(캐드,인벤터,3D프린터)','4'),
('3D프린터를 활용한 기계설계제작(캐드,인벤터','4'),('전산응용기계제도기능사(실기) 자격증 취득','4');
INSERT INTO lecture (lectureName, academyNo)
VALUES
('웹퍼블리셔(웹디자인)UI/UX 프론트엔드 양성과정','5'),('디지털앱&웹디자인콘텐츠제작','5'),
('UIUX 웹디자인 실무자 양성(웹퍼블리셔,프론트엔드)_혼합훈련','5'),('UIUX기반 스마트 웹&앱 콘텐츠개발자(웹퍼블리셔)_혼합훈련','5'),
('출판편집(전자출판&e-book)디자이너 양성','5'),('(NCS)디지털퍼블리싱 양성과정(편집디자인&E-BOOK)','5'),
('출판편집디자인(전자출판&e-book)','5'),('편집디자인(전자출판&e-book)디자이너_혼합훈련','5'),
('자바(JAVA) 웹 & 안드로이드 앱개발자 양성','5'),('빅데이터 UI 전문가 양성(파이썬,R)_A','5'),
('빅데이터 분석 & 플랫폼 개발자','5'),('빅데이터분석®을 위한 자바,파이썬 개발자','5'),
('파이썬과 R을 활용한 빅데이터분석(머신러닝,딥러닝)전문가 양성과정','5'),('전자정부 표준프레임워크 응용SW개발자 양성','5'),
('자바,파이썬을 활용한 빅데이터 분석 및 응용소프트웨어 개발자 양성','5'),('파이썬빅데이터개발,분석전문가(머신러닝,딥러닝)','5'),
('빅데이터 시각화(UI) 분석 전문가(파이썬, R)_혼합훈련','5'),('자바기반 안드로이드 앱 개발_A','5'),
('게임프로그래밍개발자 양성(유니티3D)','5'),('게임콘텐츠제작(2D&3D그래픽)실무자 양성과정','5'),
('멀티미디어콘텐츠개발(프리미어,에프터이펙트)','5'),('전산응용기계제도기능사(실기) 자격증 취득','5');